Catalogs/ТочкиДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТочкиДоставки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Партнеры</xr:Item>
				<xr:Item>Catalog.Склады</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОсновнаяТочка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторАдреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПереопределен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторТочкиДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ТочкиДоставки/Ext/ManagerModule.bsl
//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Наименование точки доставки по адресу.
// 
// Параметры:
//  АдресЗначение - Строка - JSON представление адреса
// 
// Возвращаемое значение:
//  Строка
//
Функция СокращенноеПредставлениеАдреса(АдресЗначение) Экспорт
	
	ПараметрыПолученияАдреса = Новый Структура("БезПредставлений", Истина);
	
	СтруктураАдреса = УправлениеКонтактнойИнформацией.СведенияОбАдресе(АдресЗначение, ПараметрыПолученияАдреса);
	
	ИсключаемыеУровни = ИсключаемыеУровниАдреса(СтруктураАдреса);
	Для Каждого Уровень Из ИсключаемыеУровни Цикл
		
		ОчиститьПоляАдресаПоУровню(СтруктураАдреса, Уровень);
		
	КонецЦикла;
	
	ПредставлениеJson = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВJSON(
		СтруктураАдреса,
		Перечисления.ТипыКонтактнойИнформации.Адрес);
	
	Результат = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформации(ПредставлениеJson);
	
	Возврат Результат;
	
КонецФункции

// Возвращает имена блокируемых реквизитов для механизма блокирования реквизитов БСП.
// 
// Возвращаемое значение:
//  Массив из Строка
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив; // Массив из Строка
	Результат.Добавить("Владелец");
	Результат.Добавить("Адрес");
	Результат.Добавить("ЗонаДоставки");
	
	//++ Локализация
	Результат.Добавить("ИдентификаторПереопределен");
	Результат.Добавить("ИдентификаторТочкиДоставки");
	//-- Локализация
	
	Возврат Результат;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// Возвращает имена реквизитов, которые не должны отображаться в списке реквизитов обработки ГрупповоеИзменениеОбъектов.
//
//	Возвращаемое значение:
//		Массив из Строка - массив имен реквизитов.
//
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	НеРедактируемыеРеквизиты = Новый Массив; // Массив из Строка
	
	НеРедактируемыеРеквизиты.Добавить("*");
	
	Возврат НеРедактируемыеРеквизиты;
	
КонецФункции

// Определение прав доступа
//
// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Владелец)";
	
	Ограничение.ТекстДляВнешнихПользователей =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК ЭтотСписок
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров 
	|	ПО КонтактныеЛицаПартнеров.Владелец = ЭтотСписок.Владелец
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВнешниеПользователи КАК ВнешниеПользователиПартнеры
	|	ПО ВнешниеПользователиПартнеры.ОбъектАвторизации = ЭтотСписок.Владелец
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВнешниеПользователи КАК ВнешниеПользователиКонтактныеЛица
	|	ПО ВнешниеПользователиКонтактныеЛица.ОбъектАвторизации = КонтактныеЛицаПартнеров.Ссылка
	|;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ВнешниеПользователиПартнеры.Ссылка)
	|	ИЛИ ЗначениеРазрешено(ВнешниеПользователиКонтактныеЛица.Ссылка)";

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Отбор = Параметры.Отбор; // Структура
	Если НЕ Отбор.Свойство("НеИспользуется") Тогда
		
		Отбор.Вставить("НеИспользуется", Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаВыбора"
	  И Параметры.Свойство("Отбор")
	  И Параметры.Отбор.Свойство("Владелец")
	  И ЗначениеЗаполнено(Параметры.Отбор.Владелец) Тогда
		
		ВыбраннаяФорма = Метаданные.Справочники.ТочкиДоставки.Формы.ТочкиДоставкиВладельца.ПолноеИмя();
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Сведения по основной точке доставке владельца
//
// Параметры:
//  Владелец - СправочникСсылка.Партнеры, СправочникСсылка.Склады - Владелец точки доставки
// 
// Возвращаемое значение:
//  Структура:
// * Владелец - СправочникСсылка.Партнеры, СправочникСсылка.Склады - Владелец точки доставки
// * ТочкаДоставки - СправочникСсылка.ТочкиДоставки -
// * ЗонаДоставки - СправочникСсылка.ЗоныДоставки -
// 
Функция СведенияТочкиДоставкиОсновная(Владелец) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Владелец", Владелец);
	Результат.Вставить("ТочкаДоставки", Справочники.ТочкиДоставки.ПустаяСсылка());
	Результат.Вставить("ЗонаДоставки", Справочники.ЗоныДоставки.ПустаяСсылка());
	
	Если Владелец.Пустая() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТочкиДоставки.Ссылка КАК ТочкаДоставки,
	|	ТочкиДоставки.ЗонаДоставки КАК ЗонаДоставки
	|ИЗ
	|	Справочник.ТочкиДоставки КАК ТочкиДоставки
	|ГДЕ
	|	ТочкиДоставки.Владелец = &Владелец
	|	И ТочкиДоставки.ОсновнаяТочка";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Владелец", Владелец);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИсключаемыеУровниАдреса(СтруктураАдреса)
	
	ИсключаемыеУровни = Новый Массив; // Массив из Строка
	ИсключаемыеУровни.Добавить("Индекс");
	ИсключаемыеУровни.Добавить("Район");
	ИсключаемыеУровни.Добавить("МуниципальныйРайон");
	
	Если СтруктураАдреса.Свойство("НаселенныйПункт")
		И ЗначениеЗаполнено(СтруктураАдреса.НаселенныйПункт) Тогда
		
		ИсключаемыеУровни.Добавить("Поселение");
		ИсключаемыеУровни.Добавить("Город");
		
	КонецЕсли;
	
	Возврат ИсключаемыеУровни;
	
КонецФункции

Функция ПоляУровняАдреса(Уровень)
	
	ИменаПолей = Новый Массив; // Массив из Строка
	ИменаПолей.Добавить(Уровень);
	
	Если СтрСравнить(Уровень, "Индекс") <> 0 Тогда
		
		Суффиксы = Новый Массив; // Массив из Строка
		
		Суффиксы.Добавить("ТипПолный");
		Суффиксы.Добавить("ТипКраткий");
		Суффиксы.Добавить("Сокращение");
		
		ШаблонИмениПоля = "%1%2";
		Для Каждого Суффикс Из Суффиксы Цикл
			
			ИмяПоля = СтрШаблон(ШаблонИмениПоля, Уровень, Суффикс);
			ИменаПолей.Добавить(ИмяПоля);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ИменаПолей;
	
КонецФункции

Процедура ОчиститьПоляАдресаПоУровню(СтруктураАдреса, Уровень)
	
	ПоляУровня = ПоляУровняАдреса(Уровень);
	
	Для Каждого Поле Из ПоляУровня Цикл
		
		Если СтруктураАдреса.Свойство(Поле) Тогда
			
			СтруктураАдреса[Поле] = "";
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
